MAP_DATA = {
    '서울 인천 경기': {'nx': 60, 'ny': 127},
    '부산 울산 경남': {'nx': 98, 'ny': 76},
    '대구 경북': {'nx': 89, 'ny': 90},
    '광주 전남': {'nx': 58, 'ny': 74},
    '대전 세종 충남': {'nx': 67, 'ny': 100},
    '강원 영동': {'nx': 73, 'ny': 134},
    '강원 영서': {'nx': 92, 'ny': 131},
    '충북': {'nx': 69, 'ny': 107},
    '전북': {'nx': 63, 'ny': 89},
    '제주': {'nx': 52, 'ny': 38}
}

SKY_PTY_DATA = {
    "1":{"0":"맑음", "1":"맑음", "2":"맑음", "3": "맑음", "4":"맑음"},
    "3":{"0":"구름 많음", "1":"구름많고 비", "2":"구름많고 비/눈", "3": "구름많고 눈", "4":"구름많고 소나기"},
    "4":{"0":"흐림", "1":"흐리고 비", "2":"흐리고 비/눈", "3": "흐리고 눈", "4":"흐리고 소나기"},
}

DAY_DATA = {
    0 : '오늘',
    1 : '내일',
    2 : '모레'
}

AREA_DATA = {
    '서울 인천 경기': '서울',
    '부산 울산 경남': '부산',
    '대구 경북': '대구',
    '광주 전남': '광주',
    '대전 세종 충남': '대전',
    '강원 영동': '영동',
    '강원 영서': '영서',
    '충북': '충북',
    '전북': '전북',
    '제주': '제주'
}